{
  "Articles": [
    {
      "Title": "Welcome To My New Website!",
      "Description": "After months of work, I'm proud to finally welcome you to my website! Some parts are still not 100% complete, but for now, it works perfectly!",
      "Text": "Welcome to my new website! This has been a project of mine for a couple of months, and now with the looming release of a huge project, I thought it fitting to have a personal website.\n\nIf you don't know who I am yet, I'm a Musician / Gamedev / YouTuber. I'm relativly new to the whole gamedev scene, so that's why you've probably never heard of me.\n\nThere's a lot of things on this website, so if you're a bit lost, here is a rundown:\n\n<span style=\"color:orange;\"><strong>PROJECTS</strong></span>\n\n<img src=\"/Images/NewsCoverImages/Welcome To My New Website!/Screen Shot 2021-05-10 at 00.28.02.png\" style=\"height:20vw;width:40vw;\">\n\nin this tab, you can view all my projects. There are 3 distinct sections, <span style=\"color:orange;\"><strong>Games</strong></span>, <span style=\"color:orange;\"><strong>Videos</strong></span> and <span style=\"color:orange;\"><strong>Music (still under construction)</strong></span>. \n\nThe games section holds all of my publicly released games, starting with of course, Gun & Grapple! \nThe videos section holds all of my YouTube videos across my two channels; WillyHB & AwfulWillyHBSofa.\nThe music section is currently still under construction, but after completion, will show all of the music, that I've created.\n\n<span style=\"color:orange;\"><strong>NEWS</strong></span>\n\nThe news section is basically where I update you guys on what is going on. Whether 'tis a big update, or a new release, It will all go in the news section. If it is news on a game, I will also release an identical news story on steam.\n\n<span style=\"color:orange;\"><strong>CONTACT</strong></span>\n\nBasically just a section to contact me about business, constructive critisism or just general feedback. \n\n\nAnd that's about it. I hope the website works great, as I poured my heart and soul into it!\n",
      "Date": "09/05/2021 00:03:26",
      "CoverImageFileName": "Screen Shot 2021-05-10 at 00.25.28.png",
      "ArticleImageFileNames": [
        "C:\\Users\\Willy\\Downloads\\Screen Shot 2021-05-10 at 00.28.02.png"
      ]
    },
    {
      "Title": "First Game Release!",
      "Description": "I attended the znet 2021 gamejam, and ended up releasing my first game!",
      "Text": "This year, Zaviinet (The creators of Voids Adrift) hosted a week long gamejam, which I partook in, and subsequently released my first game, <span style=\"color:orange;\"><strong> Gun & Grapple </strong></span>.\n\n<img src=\"/Images/NewsCoverImages/First Game Release!/SS_23-04-2021_20-32-57.png\" style=\"height:20vw;width:40vw;\">\n\nRight now the game is very barebones, but right now, I'm definitely considering making it into a feature length game. Though it is not possible at the current moment, as I am busy with another project, which I will reveal very soon!\n\nYou can download it for free at the Games Section of my website, I hope you enjoy it!",
      "Date": "09/05/2021 00:33:34",
      "CoverImageFileName": "SS_27-04-2021_23-59-03.png",
      "ArticleImageFileNames": [
        "C:\\Users\\Willy\\AppData\\LocalLow\\AwfulWillyHBSofa\\Gun _ Grapple\\Screenshots\\SS_23-04-2021_20-32-57.png"
      ]
    },
    {
      "Title": "Cleithrophobia Announcement",
      "Description": "My new game, which I've been working on for almost a year now, has been announced!",
      "Text": "After many months of hard work, I'm proud to finally reveal <span style=\"color:orange;\"><strong>Cleithrophobia</strong></span> to you all. \n\n<iframe width = \"40%\" height = \"500vw\" src = \"https://www.youtube.com//embed/Z253ArqGcDY\" frameborder = \"0\" allow = \"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nThe game is set underground, after you fall through the floor of a small cave, while exploring the area. You wake up realizing that there's no way to get back up, and the only way to go, is forward. Throughout your journey, you meet many interesting creatures, experience many different weather conditions, and just get to live in this massive underground environment. Though your only goal is to get back up to the surface, you might find that to be hopeless, the further and further down you get. You should never lose hope however...\n\nThe game is planned to release the <span style=\"color:orange;\"><strong>3rd November 2021</strong></span> on Steam. I may release it on other platforms, if interest is high enough. I'll reveal more about the game slowly, as up until now, you've only seen the first 3 levels, and the beginning of the 4th. \n\nEven though it's my second ever game, I still feel that it will be worth a buy for anyone who thinks it may sound interesting. ",
      "Date": "26/05/2021 21:00:00",
      "CoverImageFileName": "Main Capsule Image - Copy.png",
      "ArticleImageFileNames": []
    },
    {
      "Title": "New Trailer",
      "Description": "New Trailer, New Art, New Levels, New Feel",
      "Text": "It's been a <span style=\"color:orange;\"><strong>LONG</strong></span>  time since the last 'article', and I've been hard at work, and I'm proud to show off just a bit of that work in the new trailer which I have now released on my Youtube channel and steampage. Alongside the new trailer, I've added new art for the first and fourth level, as I felt they didn't really fit the rest of the game.\n\n<iframe width = \"40%\" height = \"500vw\" src = \"https://www.youtube.com//embed/Xf2nlJfvUa0\" frameborder = \"0\" allow = \"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen ></iframe>\n\nIn the trailer, I've not really shown off a lot of level 4 & 5. This is because they are still in heavy development, and I don't have a lot to show. Next trailer will definitely have more footage to show.\n\nTo stay up to date with the development of Cleithrophobia, or any of my future games, you can follow my twitter. I'll still be posting here, but more frequently on Twitter.",
      "Date": "23/07/2021 23:46:00",
      "CoverImageFileName": "Weather.png",
      "ArticleImageFileNames": []
    }
  ]
}